Repository: buyanaa0923/Oncall-Lab
Catalog: lib/l10n/app_*.arb
Languages: mn

source: Welcome Back
mn: Тавтай морил

source: Sign in to continue
mn: Үргэлжлүүлэхийн тулд нэвтэрнэ үү

source: Phone number
mn: Утасны дугаар

source: Password
mn: Нууц үг

source: Forgot Password?
mn: Нууц үгээ мартсан уу?

source: Password reset coming soon!
mn: Нууц үг шинэчлэх удахгүй!

source: Sign In
mn: Нэвтрэх

source: OR
mn: ЭСВЭЛ

source: Register as Patient
mn: Өвчтөнөөр бүртгүүлэх

source: Register as Doctor
mn: Эмчээр бүртгүүлэх

# pleaseEnterPhoneNumber
source: Please enter your phone number
mn: Утасны дугаараа оруулна уу

# enterValidPhoneNumber
source: Enter 8 digit number (e.g. 99123456)
mn: 8 оронтой дугаар оруулна уу (жишээ: 99123456)

# pleaseEnterPassword
source: Please enter your password
mn: Нууц үгээ оруулна уу

# passwordMinLength
source: Password must be at least 6 characters
mn: Нууц үг дор хаяж 6 тэмдэгттэй байх ёстой

source: Sign Out
mn: Гарах

source: Patient Registration
mn: Өвчтөний бүртгэл

source: Doctor Registration
mn: Эмчийн бүртгэл

source: Create Patient Account
mn: Өвчтөний бүртгэл үүсгэх

source: Create Doctor Account
mn: Эмчийн бүртгэл үүсгэх

# patientAccountCreated
source: Patient account created successfully!
mn: Өвчтөний бүртгэл амжилттай үүслээ!

# doctorAccountCreated
source: Doctor account created successfully!
mn: Эмчийн бүртгэл амжилттай үүслээ!

# stepByStepOnboarding
source: Step-by-step onboarding for a smoother experience.
mn: Алхам алхмаар бүртгүүлэх нь илүү хялбар.

source: Basics
mn: Үндсэн

source: Security
mn: Нууцлал

source: Create Account
mn: Бүртгэл үүсгэх

source: Continue
mn: Үргэлжлүүлэх

# alreadyHaveAccountSignIn
source: Already have an account? Sign in
mn: Бүртгэлтэй юу? Нэвтрэх

source: First Name
mn: Нэр

source: Last Name
mn: Овог

source: Email
mn: Имэйл

source: Email (optional)
mn: Имэйл (заавал биш)

source: Age
mn: Нас

source: Gender
mn: Хүйс

source: Male
mn: Эрэгтэй

source: Female
mn: Эмэгтэй

source: Other
mn: Бусад

source: Permanent Address
mn: Оршин суугаа хаяг

source: Registration Number
mn: Регистрийн дугаар

source: Mongolian Citizen
mn: Монгол иргэн

source: Foreign Citizen
mn: Гадаад иргэн

source: Passport Number
mn: Паспортын дугаар

# allergies
source: Allergies (medications, injections, etc.)
mn: Харшил (эм, тарилга гэх мэт)

source: Allergies (optional)
mn: Харшил (заавал биш)

source: Profile photo (optional)
mn: Профайл зураг (заавал биш)

source: Upload profile photo
mn: Профайл зураг байршуулах

source: Change photo
mn: Зураг солих

# profession
source: Profession/Specialty
mn: Мэргэжил/Чиглэл

source: License Number
mn: Лицензийн дугаар

source: Academic Degree
mn: Боловсролын зэрэг

# workExperience
source: Work Experience (years)
mn: Ажилласан жил

source: Professional Development
mn: Мэргэжлийн хөгжил

source: Register
mn: Бүртгүүлэх

# alreadyHaveAccount
source: Already have an account?
mn: Бүртгэлтэй юу?

source: Confirm Password
mn: Нууц үг баталгаажуулах

source: Passwords must match
mn: Нууц үг таарахгүй байна

source: Home
mn: Нүүр

source: Services
mn: Үйлчилгээ

source: Requests
mn: Захиалга

source: Profile
mn: Профайл

source: Lab Services
mn: Лабораторийн үйлчилгээ

source: Direct Services
mn: Шууд үйлчилгээ

source: Laboratories
mn: Лаборатори

source: Find Lab Tests
mn: Лабораторийн шинжилгээ хайх

# bookDiagnostics
source: Book Diagnostics & Nursing
mn: Оношилгоо & Сувилахуйн үйлчилгээ

source: View All
mn: Бүгдийг харах

source: Search
mn: Хайх

source: Search services...
mn: Үйлчилгээ хайх...

source: Search doctors...
mn: Эмч хайх...

source: Clinic visit
mn: Эмнэлгийн үзлэг

source: Make an appointment
mn: Цаг захиалах

source: Home visit
mn: Гэрээр үзлэг

source: Call the doctor home
mn: Эмчийг гэртээ дуудах

source: Available Tests
mn: Боломжтой шинжилгээнүүд

source: Welcome
mn: Тавтай морил

source: Error loading data
mn: Мэдээлэл ачааллахад алдаа гарлаа

source: Retry
mn: Дахин оролдох

source: Service Categories
mn: Үйлчилгээний ангилал

source: Lab Test
mn: Лабораторийн шинжилгээ

source: Diagnostic Procedure
mn: Оношилгооны процедур

source: Nursing Care
mn: Сувилахуйн үйлчилгээ

source: Price
mn: Үнэ

# priceInMNT
source: {price} MNT
mn: {price} ₮

source: Estimated Duration
mn: Үргэлжлэх хугацаа

# durationMinutes
source: {minutes} minutes
mn: {minutes} минут

# durationHours
source: {hours} hours
mn: {hours} цаг

source: Preparation Instructions
mn: Бэлтгэлийн заавар

source: Sample Type
mn: Дээжийн төрөл

source: Equipment Needed
mn: Шаардлагатай тоног төхөөрөмж

source: Book Now
mn: Захиалах

source: All Laboratories
mn: Бүх лаборатори

source: Laboratory Details
mn: Лабораторийн мэдээлэл

source: Address
mn: Хаяг

source: Phone Contact
mn: Утас

source: Operating Hours
mn: Ажлын цаг

# laboratoryTestsTitle
source: Laboratory Tests
mn: Лабораторийн шинжилгээнүүд

# searchTests
source: Search for tests...
mn: Шинжилгээ хайх...

# singleTestAvailable
source: 1 test available
mn: 1 шинжилгээ бэлэн байна

# testsAvailable
source: {count} tests available
mn: {count} шинжилгээ бэлэн байна

source: Error loading services
mn: Үйлчилгээг ачаалахад алдаа гарлаа

source: No services available
mn: Үйлчилгээ алга

source: No results found
mn: Үр дүн олдсонгүй

# noServicesMatchSearch
source: No services match your search
mn: Хайлтад тохирох үйлчилгээ алга

source: Please try again later
mn: Дараа дахин оролдоно уу

# tryDifferentKeywords
source: Try searching with different keywords
mn: Өөр түлхүүр үгээр хайгаад үзнэ үү

source: Preparation required
mn: Бэлтгэл шаардлагатай

source: Unable to load laboratories
mn: Лаборатори ачаалах боломжгүй байна

# noLaboratoriesAvailable
source: No laboratories available right now
mn: Одоогоор лаборатори алга

source: Search laboratories...
mn: Лаборатори хайх...

source: No laboratories match "{query}".
mn: “{query}”-д тохирох лаборатори алга.

# laboratoryFallback
source: Laboratory
mn: Лаборатори

source: Address not provided
mn: Хаяг байхгүй

source: Address not available
mn: Хаяг байхгүй

source: Not specified
mn: Тодорхойгүй

source: Coordinates
mn: Координат

source: Accepting requests
mn: Захиалга авч байна

source: Temporarily unavailable
mn: Түр хугацаанд боломжгүй

source: Available Services
mn: Боломжтой үйлчилгээ

# servicesCount
source: {count} services
mn: {count} үйлчилгээ

source: Available Doctors
mn: Боломжтой эмч нар

# noDoctorsAvailable
source: No doctors available at the moment
mn: Одоогоор эмч байхгүй байна

source: Doctor Details
mn: Эмчийн мэдээлэл

source: Rating
mn: Үнэлгээ

source: Experience
mn: Туршлага

# yearsExperience
source: {years} years
mn: {years} жил

source: Completed Requests
mn: Биелүүлсэн захиалга

source: Total Reviews
mn: Нийт үнэлгээ

# reviewsCount
source: {count} reviews
mn: {count} сэтгэгдэл

source: Available
mn: Боломжтой

source: Unavailable
mn: Боломжгүй

source: Bio
mn: Танилцуулга

source: Certifications
mn: Гэрчилгээ

source: Direct Doctor Services
mn: Гэрийн эмчийн үйлчилгээ

source: Book Service
mn: Үйлчилгээ захиалах

source: Select Date
mn: Огноо сонгох

source: Select Time
mn: Цаг сонгох

source: Select Time Slot
mn: Цагийн хуваарь сонгох

source: Select Doctor
mn: Эмч сонгох

source: Any Available Doctor
mn: Боломжтой аль ч эмч

source: Your Address
mn: Таны хаяг

# addressHint
source: Enter your full address
mn: Бүтэн хаягаа оруулна уу

source: Collection Address
mn: Дээж авах хаяг

# typeDifferentAddress
source: Type a different address
mn: Өөр хаяг оруулах

source: Use saved address
mn: Хадгалсан хаягаа ашиглах

source: Additional Notes
mn: Нэмэлт мэдээлэл

source: Additional Notes (optional)
mn: Нэмэлт тэмдэглэл (заавал биш)

# notesHint
source: Any special instructions or requirements
mn: Ямар нэгэн тусгай зааварчилгаа эсвэл шаардлага

# specialInstructionsHint
source: Any special instructions...
mn: Тусгай заавар байвал...

source: Confirm Booking
mn: Захиалга батлах

# requestSubmitted
source: Request submitted successfully!
mn: Захиалга амжилттай илгээгдлээ!

source: Booking Summary
mn: Захиалгын хураангуй

source: Service
mn: Үйлчилгээ

source: Date
mn: Огноо

source: Time
mn: Цаг

source: Doctor
mn: Эмч

source: Total Amount
mn: Нийт дүн

# resultsReadyHours
source: ~{hours}h for results
mn: ~{hours} цагт үр дүн гарна

source: Cancel
mn: Болих

source: Confirm
mn: Батлах

source: My Requests
mn: Миний захиалгууд

source: Pending Requests
mn: Хүлээгдэж буй захиалга

source: Active Requests
mn: Идэвхтэй захиалга

source: Request History
mn: Захиалгын түүх

source: Request Details
mn: Захиалгын дэлгэрэнгүй

source: Request ID
mn: Захиалгын дугаар

source: Patient
mn: Өвчтөн

# patientInfo
source: Patient Information
mn: Өвчтөний мэдээлэл

source: Patient Address
mn: Өвчтөний хаяг

source: Patient Notes
mn: Өвчтөний тэмдэглэл

source: Scheduled For
mn: Товлогдсон

source: Created At
mn: Үүсгэсэн

source: Status
mn: Төлөв

source: Accept Request
mn: Захиалга хүлээн авах

source: Reject Request
mn: Захиалга татгалзах

source: Update Status
mn: Төлөв шинэчлэх

source: Cancel Request
mn: Захиалга цуцлах

source: Cancellation Reason
mn: Цуцлах шалтгаан

# reasonHint
source: Please provide a reason
mn: Шалтгааныг бичнэ үү

source: No active requests
mn: Идэвхтэй захиалга алга

source: No completed requests
mn: Дууссан захиалга алга

source: No cancelled requests
mn: Цуцлагдсан захиалга алга

# requestHomeServicePrompt
source: Request a home service to get started
mn: Гэрээр үйлчилгээг захиалж эхлээрэй

# labTestServiceLabel
source: Lab Test Service
mn: Лабораторийн үйлчилгээ

# directHomeServiceLabel
source: Direct Home Service
mn: Гэрийн шууд үйлчилгээ

# scheduledAt
source: Scheduled: {date} {time}
mn: Товлосон: {date} {time}

source: Lab Test Collection
mn: Шинжилгээний дээж авах

source: Home Service Request
mn: Гэрийн үйлчилгээний захиалга

source: Pending
mn: Хүлээгдэж буй

source: Accepted
mn: Хүлээн авсан

source: On the Way
mn: Замд явж буй

source: Sample Collected
mn: Дээж авсан

source: Delivered to Lab
mn: Лаборатори хүргэсэн

source: Completed
mn: Дууссан

source: Cancelled
mn: Цуцлагдсан

source: My Profile
mn: Миний профайл

source: Edit Profile
mn: Профайл засах

source: Personal Information
mn: Хувийн мэдээлэл

source: Contact Information
mn: Холбоо барих мэдээлэл

source: Medical Information
mn: Эмнэлгийн мэдээлэл

source: Professional Information
mn: Мэргэжлийн мэдээлэл

source: Change Avatar
mn: Зураг солих

source: Save Changes
mn: Өөрчлөлт хадгалах

source: Uploading avatar...
mn: Зураг байршуулж байна...

source: Updating profile...
mn: Профайл шинэчилж байна...

source: User
mn: Хэрэглэгч

source: No phone number
mn: Утасны дугаар алга

source: Change profile photo
mn: Профайл зураг солих

# changeProfilePhotoConfirm
source: Do you want to change your profile photo?
mn: Профайл зургаа солихыг хүсч байна уу?

source: Change
mn: Солих

source: Use this photo?
mn: Энэ зургийг ашиглах уу?

# profilePhotoPreview
source: This is how your profile photo will look.
mn: Таны профайл зураг ингэж харагдах болно.

source: Profile photo updated
mn: Профайл зураг шинэчлэгдлээ

source: Failed to update photo
mn: Зураг шинэчлэхэд алдаа гарлаа

source: Profile updated successfully
mn: Профайл амжилттай шинэчлэгдлээ

source: Saved addresses
mn: Хадгалсан хаягууд

source: Edit address
mn: Хаяг засах

source: Add address
mn: Хаяг нэмэх

source: New address
mn: Шинэ хаяг

source: Save address
mn: Хаяг хадгалах

source: Remove address
mn: Хаяг устгах

source: No default address saved
mn: Үндсэн хаяг хадгалагдаагүй байна

source: Address saved
mn: Хаяг хадгалагдлаа

source: Saved address removed
mn: Хадгалсан хаяг устгагдлаа

# pleaseEnterAddress
source: Please enter your address
mn: Хаягаа оруулна уу

source: Statistics
mn: Статистик

source: Total Requests
mn: Нийт захиалга

# completedCount
source: Completed
mn: Дууссан

# pendingCount
source: Pending
mn: Хүлээгдэж буй

# cancelledCount
source: Cancelled
mn: Цуцлагдсан

# inProgressCount
source: In Progress
mn: Явагдаж буй

source: Yes
mn: Тийм

source: No
mn: Үгүй

source: OK
mn: ОК

source: Error
mn: Алдаа

source: Success
mn: Амжилттай

source: Warning
mn: Анхааруулга

source: Info
mn: Мэдээлэл

source: Loading...
mn: Ачааллаж байна...

# noData
source: No data available
mn: Мэдээлэл алга

source: Try Again
mn: Дахин оролдох

source: Close
mn: Хаах

source: Back
mn: Буцах

source: Next
mn: Дараах

source: Done
mn: Дууссан

source: Save
mn: Хадгалах

source: Delete
mn: Устгах

source: Edit
mn: Засах

source: View
mn: Харах

source: Filter
mn: Шүүх

source: Sort
mn: Эрэмбэлэх

source: Refresh
mn: Шинэчлэх

source: Required
mn: Заавал

source: Admin Panel
mn: Админ самбар

source: Dashboard
mn: Хяналтын самбар

source: Users
mn: Хэрэглэгчид

source: Patients
mn: Өвчтөнүүд

source: Doctors
mn: Эмч нар

source: All Requests
mn: Бүх захиалга

source: System Settings
mn: Системийн тохиргоо

# adminComingSoon
source: Admin experience coming soon!
mn: Админ тохиргоо удахгүй!

# adminDescription
source: We are finalizing the dedicated dashboard for this role. Please check back later or sign out to switch accounts.
mn: Бид энэ үүргийн тусгай хяналтын самбарыг бэлтгэж байна. Та дараа нь эргэж орж үзээрэй эсвэл гарч өөр бүртгэл сонгоно уу.

source: Notifications
mn: Мэдэгдэл

source: No notifications
mn: Мэдэгдэл алга

source: Mark as read
mn: Уншсан гэж тэмдэглэх

source: Mark all as read
mn: Бүгдийг уншсан гэж тэмдэглэх

source: Clear all
mn: Бүгдийг арилгах

# invalidCredentials
source: Invalid phone number or password
mn: Утасны дугаар эсвэл нууц үг буруу байна

# phoneAlreadyRegistered
source: This phone number is already registered
mn: Энэ утасны дугаар аль хэдийн бүртгэлтэй байна

# rateLimitExceeded
source: Too many attempts. Please try again later
mn: Хэтэрхий олон оролдлого. Та дараа дахин оролдоно уу

# networkError
source: Network error. Please check your connection
mn: Сүлжээний алдаа. Холболтоо шалгана уу

# unknownError
source: An unknown error occurred
mn: Тодорхойгүй алдаа гарлаа

# fieldRequired
source: This field is required
mn: Энэ талбарыг заавал бөглөнө үү

# invalidEmail
source: Please enter a valid email
mn: Зөв имэйл хаяг оруулна уу

# invalidPhoneNumber
source: Please enter a valid phone number
mn: Зөв утасны дугаар оруулна уу

# invalidAge
source: Please enter a valid age
mn: Зөв нас оруулна уу

# mustBeAtLeast
source: Must be at least {min}
mn: Дор хаяж {min} байх ёстой

# mustBeAtMost
source: Must be at most {max}
mn: Дээд тал нь {max} байх ёстой
